<template>
  <div class="reviews">
    <div class="container">
      <div class="title">Отзывы</div>
    </div>
    <swiper :options="swiperOption" class="slider">
      <swiper-slide v-for="(item, index) in reviews" :key="index">
        <div class="cart">
          <div class="d-flex justify-content-between align-items-center">
            <div class="cart__title">{{ item.name }}</div>
            <div class="card__quote">
            </div>
          </div>
          <div class="card__text">{{ item.text }}</div>
        </div>
      </swiper-slide>
      <div class="swiper-button-prev" slot="button-prev">
        <img src="/images/reviews/left.svg" alt="">
      </div>
      <div class="swiper-pagination" slot="pagination"></div>
      <div class="swiper-button-next" slot="button-next">
        <img src="/images/reviews/right.svg" alt="">
      </div>
    </swiper>
  </div>
</template>

<script>
import {Swiper, SwiperSlide} from "vue-awesome-swiper";
import "swiper/css/swiper.css";

export default {
  name: "Reviews",

  data() {
    return {
      swiperOption: {
        slidesPerView: 2,
        // spaceBetween: 30,
        grabCursor: true,
        loop: true,
        // autoplay: {
        //   delay: 5000,
        //   disableOnInteraction: false,
        // },
        pagination: {
          el: '.swiper-pagination',
          clickable: true
        },
        navigation: {
          nextEl: '.swiper-button-next',
          prevEl: '.swiper-button-prev',
          clickable: true
        }
        // breakpoints: {
        //   1440: {
        //     slidesPerView: 3,
        //     spaceBetween: 40,
        //   },
        //   768: {
        //     slidesPerView: 3,
        //     spaceBetween: 30,
        //   },
        //   320: {
        //     slidesPerView: 1,
        //     spaceBetween: 10,
        //   },
        // },
      },
      reviews: [
        {
          name: 'Агафонова Т.',
          text: 'По рекомендации с проблемами позвоночника в сентябре 2020 года ' +
            'я обратилась в филиал "Семейная клиника", конкретно к травматологу-ортопеду Макирову ' +
            'С. К.. Выявленная гемангиома позвонков угрожала компрессионным переломом позвоночника. ' +
            'Потому срочно в октябре 2020 года я была прооперирована доктором Макировым С. К. ' +
            '(по полису ОМС). Высочайший профессионализм, мастерство, добросовестное отношение к ' +
            'своей работе устранили данную проблему. Доктор Макиров С. К. - это доктор с большой буквы, ' +
            'специалист с золотыми руками. Огромная благодарность Вам, доктор С. К. М. С уважением, ' +
            'Агафонова Т., г. Москва.'
        },
        {
          name: 'Марков Д.',
          text: 'После 3 месяцев безуспешного консервативного лечения (были и уколы, и капельницы ' +
            '- помогало только, пока была терапия, корешковый синдром не проходил), обратился в клинику' +
            ' "Семейная" на Госпитальной. После первого приема с профессором Макировым - ' +
            'назначили операцию по удалению межпозвоночного диска и установки импланта через' +
            ' 3 недели. 17. 04. 2021 была успешно проведена операция. Уже через 2 часа после ' +
            'операции можно было вставать и ходить. На 3 день (19. 04) меня выписали. Боль от ' +
            'корешкового синдрома прошла сразу после операции. Швы сняли через месяц. Спасибо ' +
            'большое профессору и его команде за профессионализм и заботу о пациентах! С уважением,' +
            ' Марков Д. В.'
        },
        {
          name: '',
          text: 'Хочу выразить огромную благодарность профессору Макирову! 27 июля доктор' +
            ' Макиров провёл мне вертебропластику трёх позвонков грудного отдела, операция ' +
            'была абсолютно бесплатной, по квоте. Серик Калиулович, у Вас волшебные руки,' +
            ' Вы - врач от Бога! И я от всей души желаю Вам крепкого здоровья и долгих лет жизни! ' +
            'Спасибо за Ваш профессионализм, за любовь к пациентам, за то, ' +
            'что не потеряли сострадание к больным, спасибо за высокий уровень всей Вашей команды. Вы со своими ребятами и медсестричками работаете, как один слаженный механизм!'
        },
        {
          name: 'Семья Гаджимурадовых.',
          text: 'Чуть более двух недель прошло после операции, швы сняты, полным ходом работа и ' +
            'уже не верится, что были боли, страхи, сомнения... Консультации разных врачей.' +
            ' Огромнейшая благодарность и признательность Вам, Серик Калиулович! Вашей' +
            ' профессиональной команде! Ваше компетентное мнение, твердое слово, профессионализм' +
            ' были решающими. У Вас золотые руки, операция прошла успешно, идет восстановление.' +
            ' Позвольте пожелать Вам здоровья! Успеха в нелегком труде! Побольше талантливых учеников,' +
            ' благодарных пациентов! Семья Гаджимурадовых.'
        },
        {
          name: '',
          text: 'На днях профессор со своей командой прооперировали отца (63 года). 1,5 месяца,' +
            ' как он не мог толком передвигаться, дали о себе знать давние грыжи на уровне L3-L4, L5-S1,' +
            ' стеноз позвоночного канала, корешковый болевой синдром, всего могу не упомнить.' +
            ' Отец прилетел из другого города, и, с его слов, не ожидал настолько доброжелательного' +
            ' отношения к себе и внимания к своей проблеме. Очень порадовало то, что операцию' +
            ' удалось сделать по квоте (бесплатно), а также провести ее спустя 10 дней после ' +
            'первичного приема. Выписка произошла на 3-й день. Поднялся папа уже в день проведения ' +
            'операции. Выражаем искреннюю благодарность всей команде профессора Макирова С.! За их ' +
            'профессионализм, неравнодушие и умелые руки!'
        },
        {
          name: '',
          text: 'Мне и сейчас не верится, как я попала к такому замечательном доктору ' +
            'Макирову Серику Калиуловичу, к гениальному врачу от бога. Спасибо вам и низкий поклон,' +
            ' и всей его команде. А теперь расскажу, какие у меня были нестерпимые боли, я не могла' +
            ' нормально жить и ходить, лечение мне не помогало совсем. Нога не слушалась, это не жизнь,' +
            ' а просто ад, пока я не попало к профессионалу своего дела. Спасибо большое Тимуру Рашидовичу' +
            ' за его добродушие к людям и помощи в документах по квоте. Низкий вам поклон! Спасибо ещё раз!'
        },
        {
          name: 'Высоцкая Елена',
          text: 'Мне просто улыбнулась удача, когда я попала на прием к профессору ' +
            'Макирову Серику Калиуловичу. После первого приема доктор сразу определил, ' +
            'что у меня проблемы с позвоночником' +
            ' Через неделю, сдав все нужные анализы,' +
            ' мне была сделана декомпрессивно-стабилизирующая операция на позвоночнике.' +
            ' Хочется выразить огромную благодарность Макирову Серику Калиуловичу и его ассистенту ' +
            'Макирову Тимуру Рашидовичу – специалистам с большой буквы. Это врачи от Бога. В клинике ' +
            '«Семейная» работают только профессионалы, отличная, слаженная команда. Условия в клинике' +
            ' замечательные, отношение к пациентам чуткое и внимательное. Спасибо вам за ваш бесценный' +
            ' труд, неравнодушие, высокий профессионализм.'
        },
        {
          name: '',
          text: 'Обратилась К Серику Калиуловичу с острой болью в поясничном отделе позвоночника.' +
            ' Было принято решение проводить операцию с целью удаления грыжи. Вместе с Азатом ' +
            'Дамировичем провели отличную консультацию: всё рассказали, показали на манекене, ' +
            'объяснили. Выдали всю информацию для оформления направления на операцию по ОМС. ' +
            'Тимур Рашидович был всегда на связи и помогал со всеми возникающими вопросами в процессе' +
            ' подготовки. 19.09.2020 была проведена операция. Понравились компетентность, бережное и' +
            ' доброжелательное отношение Серика Калиуловича и его коллег. После операции также имеется' +
            ' возможность задать вопросы и получить ответы/советы.'
        },
        {
          name: 'Равиля Косоурова',
          text: 'Выражаю особую благодарность Серику Калиуловичу Макирову за то,' +
            ' что профессионально определил наиболее оптимальный метод лечения для меня' +
            ' и великолепно провел операцию на спине после серьезной травмы. Спасибо, ' +
            'Серик Калиулович! Долгих Вам лет жизни и крепкого здоровья! С уважением, ' +
            'ваша благодарная пациентка Равиля Косоурова.'
        },
        {
          name: 'Рощупкина Нина Николаевна',
          text: 'Хочу выразить огромную благодарность хирургу, профессору, вертебрологу от' +
            ' бога Макирову Серику Калиуловичу и его ассистенту Макирову Тимуру Рашидовичу.' +
            ' По результатам МРТ у меня в грудном отделе позвоночника было 4 гемангиомы и ' +
            'одна в поясничном отделе. Была назначена операция на 22.05.2019, которая прошла ' +
            'в клинике "Семейная" успешно по квоте. Из 5 гемангиом самые большие были про оперированы.' +
            ' На следующий день я уехала домой. Восстановление у меня заняло около недели. ' +
            'Низкий поклон всей бригаде, которая обеспечивала проведение операции. Спасибо ' +
            'Макирову Серику Калиуловичу и Макирову Тимуру Рашидовичу за то, что вы есть. ' +
            'И что в нашей стране есть такие хирурги от бога. С уважением, Рощупкина Нина ' +
            'Николаевна, г. Москва.'
        }
      ]
    }
  }
}
</script>

<style scoped lang="scss">
.reviews {
  background: url("/images/reviews/bg.jpg");
  background-size: cover;
}

.cart {
  padding: 60px 41px 0 62px;
  width: 600px;
  height: 720px;
  background: #FFFFFF;
  box-shadow: 0 20px 40px rgba(0, 0, 0, 0.1);
  border-radius: 10px
}

.cart__title {
  font-size: 28px;
  font-weight: 500;
  color: #003D4A;
}

.card__quote::after {
  //width: 81px;
  //height: 68px;
  ////font-size: 176px;
  ////font-weight: 600;
  ////color: rgba(1, 151, 184, 0.17);
  ////transform: matrix(-1, 0, 0, 1, 0, 0);
  //padding: 25px;
  //background: rgba(1, 151, 184, 0.17);
  //border: 1px solid rgba(1, 151, 184, 0.17);
  content: "\201c";
  font-size: 176px;
  margin-top: -10px;
  margin-bottom: -80px;
  font-weight: 600;
  color: rgba(1, 151, 184, 0.17);
}

.card__text {
  margin-top: 33px;
  font-size: 22px;
  font-weight: 400;
  color: #003D4A;

}

.slider {
  padding-top: 94px;
  padding-bottom: 65px;
  width: 100%;
  max-width: 1300px;
}

.swiper-slide {
  display: flex;
  justify-content: center;
}


.swiper-button-prev {
  padding: 19px 24px 19px 20px;
  top: 100%;
  left: 2%;
}

.swiper-button-next {
  padding: 19px 21px 19px 24px;
  top: 100%;
  right: 2%;
}

.swiper-button-prev, .swiper-button-next {
  position: absolute;
  width: 58px;
  height: 58px;
  background: #20B6D8;
  box-shadow: 0 15.1905px 27.619px rgba(32, 182, 216, 0.29);
  border-radius: 38.0328px;
}


</style>
